essay/note/todo.org
* todo
** TODO 了解几种DB Riak,CouchDB,CouchBase,MemSQL
    - http://kkovacs.eu/cassandra-vs-mongodb-vs-couchdb-vs-redis
    - http://www.slideshare.net/DstroyAllModels/riak-training-session-surge-2011
    - http://www.rethinkdb.com/blog/
    - dynamo, cassandra, dynamo文章似乎有点难懂，可能需要查阅一下资料才行
** TODO RSS system we make
** TODO RSS paper planes
** TODO RSS All things Distributed.
** TODO 阅读RSS订阅（when free）
** TODO 《失控》,《浅薄》
** TODO 老婆健身计划以及怀孕
** TODO 租房
   - 年后
** TODO 找中医并且调理身体
** TODO clojure
** TODO gfs2(Colossus)
** TODO oceanbase
   - 阅读设计文档
** TODO 使用nginx + uwsgi+ web.py搭建服务？
** TODO collectl
** TODO 修改gz2lzo成为mapper方式
   - 在测试环境运行测量时间
   - 切换服务器时间之后完成
   - 修改gunzip和lzo方式，单独程序完成。
** TODO 分析htable代码put
** TODO 修改segment mark部分，多路hbase同时输入
** TODO 分布式学习材料。
** TODO 汽车首保

** 作息时间调整
   - 7:00 起床，运动10分钟，然后冥想
   - 7:30 吃饭，并且打开电脑或者是阅读书籍
   - 8：30 上班出发，大约9：30到单位
   - 每1.5个小时起来活动一次，中午12：00，下午3：00，以及下午6：00三次处理家里的事情
   - 晚上8：30开始回家，大约10：00到家
   - 洗刷10：30确保上床
   - 11：00睡觉
