www/note/todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>todo</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="todo"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-16 08:23:19 CST"/>
<meta name="author" content="dirtysalt"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../site.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">todo</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 todo</a>
<ul>
<li><a href="#sec-1-1">1.1 了解几种DB Riak,CouchDB,CouchBase,MemSQL</a></li>
<li><a href="#sec-1-2">1.2 RSS system we make</a></li>
<li><a href="#sec-1-3">1.3 RSS paper planes</a></li>
<li><a href="#sec-1-4">1.4 RSS All things Distributed.</a></li>
<li><a href="#sec-1-5">1.5 阅读RSS订阅（when free）</a></li>
<li><a href="#sec-1-6">1.6 《失控》,《浅薄》</a></li>
<li><a href="#sec-1-7">1.7 老婆健身计划以及怀孕</a></li>
<li><a href="#sec-1-8">1.8 租房</a></li>
<li><a href="#sec-1-9">1.9 找中医并且调理身体</a></li>
<li><a href="#sec-1-10">1.10 clojure</a></li>
<li><a href="#sec-1-11">1.11 gfs2(Colossus)</a></li>
<li><a href="#sec-1-12">1.12 oceanbase</a></li>
<li><a href="#sec-1-13">1.13 使用nginx + uwsgi+ web.py搭建服务？</a></li>
<li><a href="#sec-1-14">1.14 collectl</a></li>
<li><a href="#sec-1-15">1.15 修改gz2lzo成为mapper方式</a></li>
<li><a href="#sec-1-16">1.16 分析htable代码put</a></li>
<li><a href="#sec-1-17">1.17 修改segment mark部分，多路hbase同时输入</a></li>
<li><a href="#sec-1-18">1.18 分布式学习材料。</a></li>
<li><a href="#sec-1-19">1.19 汽车首保</a></li>
<li><a href="#sec-1-20">1.20 作息时间调整</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> todo</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="todo TODO"> TODO</span> 了解几种DB Riak,CouchDB,CouchBase,MemSQL</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li><a href="http://kkovacs.eu/cassandra-vs-mongodb-vs-couchdb-vs-redis">http://kkovacs.eu/cassandra-vs-mongodb-vs-couchdb-vs-redis</a>
</li>
<li><a href="http://www.slideshare.net/DstroyAllModels/riak-training-session-surge-2011">http://www.slideshare.net/DstroyAllModels/riak-training-session-surge-2011</a>
</li>
<li><a href="http://www.rethinkdb.com/blog/">http://www.rethinkdb.com/blog/</a>
</li>
<li>dynamo, cassandra, dynamo文章似乎有点难懂，可能需要查阅一下资料才行
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="todo TODO"> TODO</span> RSS system we make</h3>
<div class="outline-text-3" id="text-1-2">

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="todo TODO"> TODO</span> RSS paper planes</h3>
<div class="outline-text-3" id="text-1-3">

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> <span class="todo TODO"> TODO</span> RSS All things Distributed.</h3>
<div class="outline-text-3" id="text-1-4">

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> <span class="todo TODO"> TODO</span> 阅读RSS订阅（when free）</h3>
<div class="outline-text-3" id="text-1-5">

</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> <span class="todo TODO"> TODO</span> 《失控》,《浅薄》</h3>
<div class="outline-text-3" id="text-1-6">

</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> <span class="todo TODO"> TODO</span> 老婆健身计划以及怀孕</h3>
<div class="outline-text-3" id="text-1-7">

</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> <span class="todo TODO"> TODO</span> 租房</h3>
<div class="outline-text-3" id="text-1-8">

<ul>
<li>年后
</li>
</ul>

</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> <span class="todo TODO"> TODO</span> 找中医并且调理身体</h3>
<div class="outline-text-3" id="text-1-9">

</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> <span class="todo TODO"> TODO</span> clojure</h3>
<div class="outline-text-3" id="text-1-10">

</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> <span class="todo TODO"> TODO</span> gfs2(Colossus)</h3>
<div class="outline-text-3" id="text-1-11">

</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> <span class="todo TODO"> TODO</span> oceanbase</h3>
<div class="outline-text-3" id="text-1-12">

<ul>
<li>阅读设计文档
</li>
</ul>

</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> <span class="todo TODO"> TODO</span> 使用nginx + uwsgi+ web.py搭建服务？</h3>
<div class="outline-text-3" id="text-1-13">

</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> <span class="todo TODO"> TODO</span> collectl</h3>
<div class="outline-text-3" id="text-1-14">

</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> <span class="todo TODO"> TODO</span> 修改gz2lzo成为mapper方式</h3>
<div class="outline-text-3" id="text-1-15">

<ul>
<li>在测试环境运行测量时间
</li>
<li>切换服务器时间之后完成
</li>
<li>修改gunzip和lzo方式，单独程序完成。
</li>
</ul>

</div>

</div>

<div id="outline-container-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> <span class="todo TODO"> TODO</span> 分析htable代码put</h3>
<div class="outline-text-3" id="text-1-16">

</div>

</div>

<div id="outline-container-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="section-number-3">1.17</span> <span class="todo TODO"> TODO</span> 修改segment mark部分，多路hbase同时输入</h3>
<div class="outline-text-3" id="text-1-17">

</div>

</div>

<div id="outline-container-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="section-number-3">1.18</span> <span class="todo TODO"> TODO</span> 分布式学习材料。</h3>
<div class="outline-text-3" id="text-1-18">

</div>

</div>

<div id="outline-container-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="section-number-3">1.19</span> <span class="todo TODO"> TODO</span> 汽车首保</h3>
<div class="outline-text-3" id="text-1-19">


</div>

</div>

<div id="outline-container-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="section-number-3">1.20</span> 作息时间调整</h3>
<div class="outline-text-3" id="text-1-20">

<ul>
<li>7:00 起床，运动10分钟，然后冥想
</li>
<li>7:30 吃饭，并且打开电脑或者是阅读书籍
</li>
<li>8：30 上班出发，大约9：30到单位
</li>
<li>每1.5个小时起来活动一次，中午12：00，下午3：00，以及下午6：00三次处理家里的事情
</li>
<li>晚上8：30开始回家，大约10：00到家
</li>
<li>洗刷10：30确保上床
</li>
<li>11：00睡觉
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-16 08:23:19 CST</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
<html><body>
<script type="text/javascript">
var _bdhmProtocol = (("https:" == document.location.protocol) ? " https://" : " http://");
document.write(unescape("%3Cscript src='" + _bdhmProtocol + "hm.baidu.com/h.js%3F54a700ad7035f6e485eaf2300641e7e9' type='text/javascript'%3E%3C/script%3E"));
</script></body></html>